{
  "No description found, select a description first": "Description non trouvée, ouvrez une description d'API d'abord",
  "No endpoints selected, select endpoints first": "Aucune API sélectionnée, sélectionnez des APIs d'abord",
  "No workspace folder found, open a folder first": "Aucun environment de travail sélectionné, ouvrez un environment de travail d'abord",
  "Yes": "Oui",
  "No": "Non",
  "not found": "non trouvé",
  "error updating the clients {error}": "erreur lors de la mise à jour des clients {error}",
  "updating client with path {path}": "mise à jour du client {path}",
  "Kiota Dependencies Information": "Informations sur les dépendances Kiota",
  "Installation commands": "Commandes d'installation",
  "Dependencies": "Dépendances",
  "No language selected, select a language first": "Aucun langage sélectionné, sélectionnez un langage d'abord",
  "Open an API description": "Ouvrir une description d'API",
  "A path or url to an OpenAPI description": "Un chemin ou une adresse de description d'API",
  "Search for an API description": "Recherchez une description d'API",
  "Enter a search query": "Entrez une requête de recherche",
  "Pick a search result": "Sélectionnez un résultat de recherche",
  "Generate an API client": "Générer un client d'API",
  "Choose a name for the client class": "Choisissez un nom pour la classe client",
  "Choose a name for the client class namespace": "Choisissez un nom pour l'espace de nom client",
  "Enter an output path relative to the root of the project": "Entrez un chemin relatif à la racine du projet",
  "Pick a language": "Sélectionnez un langage",
  "Downloading kiota requires an internet connection. Please check your connection and try again.": "Télécharger Kiota nécessite une connexion Internet. Vérifiez votre connexion et réessayez.",
  "Kiota download failed. Check the extension host logs for more information.": "Échec du téléchargement de Kiota. Vérifiez les journaux de l'hôte d'extension pour plus d'informations.",
  "Downloading kiota...": "Téléchargement de Kiota...",
  "Generating client...": "Génération du client...",
  "Updating clients...": "Mise à jour des clients...",
  "Loading...": "Chargement...",
  "Pick a lock file": "Sélectionnez un fichier verrou",
  "Open a lock file": "Ouvrir un fichier verrou"
}
